[{"College Name":"AIIMS Patna Admission 2024: Dates, Courses, Fees, Eligibility, Cutoff, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/25410_JPNAIIMS_APP.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc (Nursing)  | M.Ch ","Application Date":"June 29th, 2024","College Location":"Patna,  Bihar","College Afilliation":"","College Info":"AIIMS Patna offers admission to MBBS and B.Sc (Hons) Nursing at the UG level, MD\/MS at the PG level, and DM\/M\/.Ch at the Super Specialty level. AIIMS Patna is one of the six AIIMS established by the Ministry of Health & Family Welfare, Government of India in the year 2012. AIIMS Patna is an ‘Institute of National Importance’ and is a premier medical institute in India.  "},{"College Name":"AIIMS Bhubaneswar Admission 2024: Dates, Courses, Fees, Eligibility, Selection Process, Cutoff","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/25753_AIIMS_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc (Nursing)  | MBBS ","Application Date":"June 29th, 2024","College Location":"Bhubaneswar,  Odisha","College Afilliation":"","College Info":"AIIMS Bhubaneswar Admission to MD, MS, M.Ch, and D.M courses for January 2024 Session have started. All India Institute of Medical Sciences Bhubaneswar is a premier government medical institute ranked 17th in NIRF 2023 Ranking in Medical Category. It has also been recognized as an ‘Institute of National Importance’ in India. AIIMS Bhubaneswar offers admission to various courses at the Undergraduate, Postgraduate, and Super Specialty levels."},{"College Name":"NID Assam Admission 2024: Dates, Fees, Eligibility Criteria, Selection, Cutoff","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/160023880809.jpg?h=160&w=313&mode=stretch","Course Name":"","Application Date":"June 29th, 2024","College Location":"Jorhat,  Assam","College Afilliation":"","College Info":"NID Assam offers admission to only Bachelor of Design (B.Des) in full-time mode at the undergraduate level for a duration of 4 Years. Candidates must have passed 10+2 in any stream to be eligible to apply for NID Assam Admission. Admission to B.Des at NID Assam is based on the score obtained by the candidates in the NID Design Aptitude Test (NID DAT). NID DAT has two stages namely DAT Prelims and DAT Mains. Eligible candidates have to first appear for NID DAT Prelims. Based on the merit in NID DAT Prelims, the candidates will be shortlisted for NID DAT Mains. The final selection for NID Assam Admission will be based on the sum total of the weighted scores obtained by the candidates in DAT Prelims and DAT Mains. NID Assam offers B.Des in three specializations namely Industrial Design, Communication Design, and Textile & Apparel Design. Candidates enrolled in B.Des at NID Assam will have to first attend a mandatory one-year foundation program. The allotment of the desired specialization will be based on the candidate’s performance during the foundation program. The institute offers 25 Seats for each specialization of B.Des leading to a total of 75 Seats for the entire course. Candidates need to apply online for NID Assam Admission on its official website. The application fee for admission is INR 3,000 for General\/ EWS\/ OBC and INR 1,500 for SC\/ ST\/ PwD.The important details about NID Assam Admission are as follows: "},{"College Name":"KIIT - Kalinga Institute of Industrial Technology Admission 2024: Dates, KIITEE, Fees,  Eligibility, Selection, Registration","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14878534504.jpg?h=160&w=313&mode=stretch","Course Name":"B.Arch  | B.Com ","Application Date":"June 29th, 2024","College Location":"Bhubaneswar,  Odisha","College Afilliation":"","College Info":"If you haven’t appeared for KIITEE and want to get direct admission to KIIT, you will have to choose one of the 2 ways mentioned below"},{"College Name":"Aditi Mahavidyalaya Delhi Admission 2024: Courses, Cutoff, Eligibility, Application Process, Dates","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1491907072cvr.png?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Ed ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Aditi Mahavidyalaya Admission 2024 has started. The admission process is carried out for UG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to the UG level. The entrance exams are administered by NTA. CUET UG is generally conducted in March, every year. The Aditi Mahavidyalaya admission cutoff 2024 for the general category students is expected to range between 693 and 755 marks in CUET UG. For admission at Aditi Mahavidyalaya, the registration process generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Aditi Mahavidyalaya courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check: Aditi Mahavidyalaya Courses & Fees "},{"College Name":"NID Bhopal Admission 2024: Dates, Courses, Fees, Eligibility Criteria, Selection, Cutoff","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1638874237maxresdefault.jpg?h=160&w=313&mode=stretch","Course Name":"","Application Date":"June 29th, 2024","College Location":"Bhopal,  Madhya Pradesh","College Afilliation":"","College Info":"NID Bhopal offers a full-time four-year Bachelor of Design (B.Des program) in three specializations in the field of Design namely, Industrial Design, Communication Design, and Textile & Apparel Design. The institute offers a total of 75 Seats for B.Des (25 for Each Specialization) for Indian Nationals and 11 Seats for International Students. Candidates admitted to the B.Des program at NID Bhopal will have to attend a mandatory one-year foundation program. The allotment of the desired discipline will be based on the candidate’s performance during the foundation program. Candidates must have passed 10+2 in any stream to be eligible to apply for NID Bhopal Admission. Candidates will be offered admission to B.Des at NID Bhopal based on the score in the NID DAT (Design Aptitude Test). NID DAT involves two stages namely DAT Prelims and DAT Mains. Candidates will have to first appear for NID DAT Prelims, and based on their merit in the same, they will be shortlisted for DAT Mains. The final selection will be based on the sum total of the weighted scores obtained by the candidates in DAT Prelims and DAT Mains. Candidates seeking admission to NID Bhopal need to apply online on the official website of NID. The application fee to apply online for NID Bhopal Admission is INR 3,000 for General\/ EWS\/ OBC, INR 1,500 for SC\/ ST\/ PwD, and INR 5,000 for Overseas Candidates.Here are the important details about NID Bhopal Admission:"},{"College Name":"Mar Dioscorus College of Pharmacy Admission 2024: Courses, Placement, Entrance Exam, Notification","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9684_MDCP_APP.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Thiruvananthapuram,  Kerala","College Afilliation":"","College Info":"Mar Dioscorus College of Pharmacy was started in the year 2004 in Thiruvananthapuram, Kerala. It is affiliated to Kerala University of Health Sciences, Thrissur.Mar Dioscorus College of Pharmacy offers UG degree in B.Pharm with a total of 60 seats and PG degree in M.Pharm with about 18 seats."},{"College Name":"L.M. College of Pharmacy, Ahmedabad Admission 2024: Fees Structure, Entrance Exam, Admit Crad","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9619_LMCP_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Ahmedabad,  Gujarat","College Afilliation":"GTU, Ahmedabad","College Info":"L.M. College of Pharmacy (LMCP), established in 1947 is located in Ahmedabad, Gujarat. The college is affiliated to Gujarat Technological University.At the UG level, B.Pharma is offered with a total intake of 75 seats. At the PG level, LM College of Pharmacy offers M.Pharma in 5 specializations. It also offers D.Pharm, Ph.D. and Pharm.D. Program respectively. "},{"College Name":"KVM College of Pharmacy, Cherthala Admission 2024: Courses, Fees Structure, Merit List","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9587_KVMCP_APP.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Cherthala,  Kerala","College Afilliation":"","College Info":"KVM College of Pharmacy is situated in Cherthala, Alleppey, Kerala which was established in 2010. It is recognized by Government of Kerala and approved by Pharmacy Council of India (PCI) New Delhi and All India Council of Technical education (AICTE) New Delhi and is affiliated to Kerala University of Health Science (KUHS) Thrissur.KVM College of Pharmacy offers four-year Bachelor of Pharmacy (B.Pharm), B.Pharm (Lateral), two-year Diploma in Pharmacy (D.Pharm), and six-year Doctorate in pharmacy (Pharm.D)."},{"College Name":"KLE’s University College of Pharmacy Admission 2024: Fees Structure, Courses, Cutoff, Entrance Exam","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9573_cvr.png?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Belgaum,  Karnataka","College Afilliation":"KLE University, Belgaum","College Info":"KLE’s University College of Pharmacy was established in 1968 in Belgaum, Karnataka. All the courses of the college are approved by Pharmacy Council of India (PCI).KLE College of Pharmacy offers under graduate, post graduate and post baccalaureate and Doctorate level in Pharmacy. Apart from the pharmacy courses, it also offers Master’s program in Clinical Research."},{"College Name":"Rishihood University Admission 2024: Courses, Fees, Application Process, Eligibility","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1703482183IMG5132scaled.jpg?h=160&w=313&mode=stretch","Course Name":"B.Des  | B.Sc ","Application Date":"June 29th, 2024","College Location":"Sonepat,  Haryana","College Afilliation":"","College Info":"Rishihood University is currently accepting admission for UG courses. Admissions are offered in courses like BSc (Hons.) Psychology, B.Des, BBA and B.Tech at the UG level. Applicants are evaluated on the basis of their overall performance across our selection criteria that includes past academic records, personal interview, admission test scores and others.Note: Candidates can avail scholarship upto 15%"},{"College Name":"KLE College of Pharmacy, Hubli Admission 2023, Fees Structure, Admission Process, Eligibility","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9570_cvr.png?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Hubli,  Karnataka","College Afilliation":"RGUHS, Bangalore","College Info":"KLE College of Pharmacy, Hubli campus (KLECPH) is a constituent college of the KLE University (deemed-to-be), Belgaum. It was established in the year 1985 by the KLE Society. The college is affiliated to Rajiv Gandhi University of Health Sciences, Karnataka, and the Bachelor’s and Master’s degree programs offered by the institute are approved by the All India Council for Technical Education (AICTE), New Delhi.The College currently offers two UG courses, viz. B. Pharm. and Pharm. D., a PG program (M. Pharm.) with 4 branches, and a Ph.D. program in 4 different pharmacy specializations, viz. Pharmaceutics, Pharmacology, Pharmacognosy, and Pharmachemistry. KLECPH was ranked #37 in the National Institutional Ranking Framework pharmacy ranking 2021."},{"College Name":"NIT Andhra Pradesh Courses Admissions 2024: Dates, Eligibility, Cutoff, Selection, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/_adminbuildingnitap.jpg?h=160&w=313&mode=stretch","Course Name":"M.Phil\/Ph.D in Science ","Application Date":"June 29th, 2024","College Location":"Tadepalligudem,  Andhra Pradesh","College Afilliation":"","College Info":"NIT Andhra Pradesh offers a four-year B.Tech program in 5 specializations. Out of 5 specializations offered, the most opted stream at the institute is Computer Science and Engineering (CSE) with a cutoff ranging from 8140 to 17474 in the JoSAA Counselling. The cutoff marks for all rounds of JoSAA are out. Candidates can check NIT Andhra Pradesh JEE Main Cutoff here.For the B.Tech admissions at NIT Andhra Pradesh, candidates are required to appear for JEE Main examination and participate in the JoSAA counseling for the final seat allotments. NIT Andhra Pradesh Charges a fee of INR 1.88 Lakhs per year for its B.Tech program. NIT Andhra Pradesh admission process involves other national level examinations too such as GATE for M.Tech. The selection criteria, cutoff, dates, eligibility, and application process are discussed in the article."},{"College Name":"LNMU Admission 2024: UG, PG, PhD, Courses, Eligibility, Application Form, Last Date to Apply","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/25413_LNMU_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Ed ","Application Date":"June 29th, 2024","College Location":"Darbhanga,  Bihar","College Afilliation":"","College Info":"Yes, you can take direct admission to LNMU. Students who don’t get the college through the merit lists can take direct admission through LNMU Spot Admission. During admission cycle of last year, the university offered spot round admission to B.A, B.Sc, B.Com, after merit list 1 & 2 admissions were completed. The spot round admissions were done based on vacant seats. You can get the vacant seat information for your subject on the official website of the institute. If seats are available, you can contact the college for direct admission. "},{"College Name":"Institute of Pharmacy, Nirma University Admission 2024: Courses, Placement, Fees Structure, Merit List","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1622451787SUR55451024x305.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Ahmedabad,  Gujarat","College Afilliation":"Nirma University, Ahmedabad","College Info":"One of India’s leading universities based in Ahmedabad (Gujarat), Nirma University was established in the year 2003. The Institute of Pharmacy was established the same year with a view to promote excellence in pharmaceutical education and to face challenges in the area of pharmaceutical industries, education, research & development and marketing. Institute of Pharmacy, Nirma University received All India Rank # 37 for year 2023 by the National Institutional Ranking Framework (NIRF), MHRD, Government of India. The institute provides degree, postgraduate and doctoral level education at this centre of excellence."},{"College Name":"Saraswati College of Engineering (SCOE) Navi Mumbai Admission 2024: Cut Off, Reservation","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1716805408Coverimage11zon1.jpg?h=160&w=313&mode=stretch","Course Name":"BE\/B.Tech ","Application Date":"June 29th, 2024","College Location":"Navi Mumbai,  Maharashtra","College Afilliation":"Mumbai University, Mumbai","College Info":"Saraswati College of Engineering is a premier engineering institute in Kharghar, Navi Mumbai. The college was established in September 2004 and is affiliated to Mumbai University.SCOE Kharghar offers four-year B.E courses and two-year M.E courses. The annual intake for Bachelor’s and Master’s degree program in Engineering is 630 and 18, respectively."},{"College Name":"IES College of Pharmacy Bhopal Admission 2023, Fees Structure, Cutoff, Ranking","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14902688614.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Bhopal,  Madhya Pradesh","College Afilliation":"RGPV, Bhopal","College Info":"IES College of Pharmacy is a private institution which is located in the city of Bhopal, Madhya Pradesh, India. The institute is affiliated to Rajiv Gandhi Proudyogiki Vishwavidyalaya, Bhopal and was established in 1999."},{"College Name":"IMS Noida Admission 2024: Application form, Eligibility, Selection","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1486632852IMSNoida.jpg?h=160&w=313&mode=stretch","Course Name":"MBA\/PGDM ","Application Date":"June 29th, 2024","College Location":"Noida,  Uttar Pradesh","College Afilliation":"CCSU, Meerut","College Info":"Institute of Management Studies (IMS) Noida is accepting applications for its UG & PG Courses. Candidates interested in admission to IMS Noida courses are requested to appear for Joint Entrance Test (JET) conducted by the Institute on their premises. IMS Noida campus is equipped with all the facilities, from Lecture & Seminar Halls to Library and Laboratories. In the placement drive of 2022 of IMS Noida, the highest CTC stood at INR 12 LPA and the average CTC stood at INR 6.28 LPA. IMS Noida is ranked 17th in Private B-school in Delhi-NCR by The Week.IMS Noida Campus Review"},{"College Name":"HIMT College of Pharmacy Greater Noida Admission 2024: Fees Structure, Courses, Cutoff, Notification","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1499849618abouhimt1.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Greater Noida,  Uttar Pradesh","College Afilliation":"AKTU, Lucknow","College Info":"HIMT College of Pharmacy offers admission in three major courses viz. Diploma in Pharmacy, Bachelor’s in Pharmacy (B. Pharma) and Master’s in Pharmacy (M. Pharma).HIMT College of Pharmacy came into existence in the year 2005 in Greater Noida, Uttar Pradesh. It is affiliated by Dr. A. P. J. Abdul Kalam Technical University (AKTU), Lucknow."},{"College Name":"G Pulla Reddy College of Pharmacy (GPRCP), Hyderabad Admission 2023, Placement, Syllabus, Fees Structure, Cutoff","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9412_build.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Hyderabad,  Telangana","College Afilliation":"Osmania University, Hyderabad","College Info":"G. Pulla Reddy College of Pharmacy is the center for research in Pharmacy. It was established in 1994 and is located in Hyderabad. The college is affiliated to Osmania University and is AICTE approved. G Pulla Reddy College of Pharmacy offers B. Pharm, M. Pharm, Ph.D. and D.Pharm courses at the UG, PG and research level."},{"College Name":"NIT Mizoram Courses Admission 2024:  Eligibility, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/28298_NITMZ_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"BE\/B.Tech  | M.Phil\/Ph.D in Arts ","Application Date":"June 29th, 2024","College Location":"Aizawl,  Mizoram","College Afilliation":"","College Info":""},{"College Name":"Dayananda Sagar College of Pharmacy (DSCP) Bangalore Admissions 2023, Fees Structure, Review, Eligibility, Entrance Exam","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9370_Capture.JPG11.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Bangalore,  Karnataka","College Afilliation":"RGUHS, Bangalore","College Info":"Originated in the year 1991, Dayananda Sagar College of Pharmacy (DSCP) is situated in Bangalore, Karnataka. Affiliated to Rajiv Gandhi University of Health Sciences, Bangalore, the college offers a 6-years Doctorate in Pharmacy (Pharma D.), 4-years Bachelor in Pharmacy (B. Pharma) and 2-years M. Pharma.  "},{"College Name":"Madras University Admissions 2024: UG, PG, PhD, Courses, Eligibility, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/15047804851443184840UOMNEW.jpg?h=160&w=313&mode=stretch","Course Name":"BA  | Executive MBA ","Application Date":"June 29th, 2024","College Location":"Chennai,  Tamil Nadu","College Afilliation":"","College Info":"Madras University offers admission to the PG, Research, Diploma, and Certificate programs through its affiliated colleges. The courses are offered in areas of sciences, social sciences, humanities, management, and medicine. Madras University also offers various UG and PG programs through distance education under its Institute of Distance Education (IDE).Madras University admission is granted on the basis of merit or entrance examination. Admission to the UG courses is based on merit in the qualifying exam while PG admissions are offered on the basis of the entrance exam conducted by the university. Candidates seeking admission to the MBA and MCA programs need to have a valid score in the TANCET entrance examination.Madras University PhD admission is done through a written test and personal interview conducted by the university. Candidates having valid scores in the UGC NET\/ CSIR NET entrance examination are exempted from the written test. Application forms for Madras University courses can be filled online by visiting the official website of the university."},{"College Name":"Dadhichi College of Pharmacy (DCP), Cuttak Admission 2023, Fees Structure, Courses, Review","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9365_DCPC_APP.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Cuttack,  Odisha","College Afilliation":"","College Info":"Dadhichi College of Pharmacy, established in 2005, is a premier pharmaceutical training institute located in Cuttack, Orissa. The college is affiliated to the Biju Patnaik University of Technology, Orissa and offers UG, Diploma and PG courses in the field of pharmaceutical studies.The Undergraduate courses offered by Dadhichi College of Pharmacy includes B.Pharm. Program which has a total duration of four-year and M.Pharm. Program has a total duration of two-year. It is offered in specializations like Pharmaceutics and Pharmacology with each of the stream having an intake of 18 students each."},{"College Name":"Chalapathi Institute of Pharmaceutical Sciences Admission 2024: Dates, Courses, Fees, Cutoff, Application Form","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9339_CIPS_APP.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Guntur,  Andhra Pradesh","College Afilliation":"ANU, Guntur","College Info":"Chalapathi Institute of Pharmaceutical Sciences was established in the year 2004 in Guntur, Andhra Pradesh. The college is affiliated with Acharya Nagarjuna University (ANU), Guntur. Ph.D and M.Phil programs are affiliated to Krishna University. Chalapathi Institute of Pharmaceutical Sciences offers B.Pharm course of four-year duration, M.Pharm program of two-year duration with 5 specializations, and Pharm.D course of 6 years duration. The college also offers full-time, part-time, and independent Ph.D. and M.Phil. Program."},{"College Name":"Bhaskar Pharmacy College, Rangareddi Admission 2023, Fees Structure, Cutoff, Entrance Exam","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9310_5.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Hyderabad,  Telangana","College Afilliation":"JNTUH, Hyderabad","College Info":"Bhaskar Pharmacy College was founded in the year 2007 in Rangareddi, Telangana. The college is affiliated with Jawaharlal Nehru Technological University, Hyderabad.Bhaskar Pharmacy College offers B.Pharm course of four-year duration, the M.Pharm course of two-year duration, and Pharm.D program of six-year duration in its curriculum."},{"College Name":"Bharati Vidyapeeth College of Pharmacy (BVCP), Kolhapur Admission 2024, Placement, Entrance Exam, Review","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9305_bharti_new.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Kolhapur,  Maharashtra","College Afilliation":"Shivaji University, Kolhapur","College Info":"Bharati Vidyapeeth College of Pharmacy (BVCP) was established in the year 1996 by Bharati Vidyapeeth group. The college is located in Kolhapur district, Maharashtra. It is affiliated with Shivaji University, Kolhapur.Bharati Vidyapeeth Pharmacy College, Kolhapur offers a 4-year undergraduate degree B. Pharm, a 3-year M. Pharm degree at the PG level including a Ph.D. program in Pharmacy sciences, all of which are approved by AICTE, New Delhi."},{"College Name":"Bapatla College of Pharmacy (BCOP) Guntur Admission 2023, Fees Structure, Courses, Placement","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9293_z00.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Guntur,  Andhra Pradesh","College Afilliation":"JNTUK, Kakinada","College Info":"Bapatla College of Pharmacy was founded by Bapatla Education Society in the year 1995 in Guntur, Andhra Pradesh. The college is affiliated to Jawaharlal Nehru Technological University, Hyderabad.Bapatla College of Pharmacy is known for its B. Pharma course under UG Program and M. Pharma course under its PG Program with 3 specializations each.  "},{"College Name":"Hindu College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1492065245cover..png?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Hindu College Admission 2024 are ongoing on the official website. The college carries out admission to all UG and PG courses through Delhi University’s Common Seat Allocation System (DU CSAS). For the UG courses, CUET UG scores are accepted. Hindu College accepts CUET PG for admission to MA, M.Com and M.Sc programs.The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The results are released within a month of the completion of exam. After this, for admission, candidates must register for the DU CSAS (UG & PG) registration process and choose Hindu College and available courses as their preference. Based on the preferences & reservation criteria, Delhi University releases the seat allotment results in multiple rounds. The Hindu College admission cut off for B.Sc (Hons.) Chemistry and BA (Hons.) Political Science ranges between 750 and 775 marks for general category students. Additionally, Delhi University has introduced a reservation of one seat in every course to single girl child students. Once candidates get allocated Hindu College with their chosen course, they must accept and lock their options to get a seat at the college. Then, the verification of documents is carried out by the college admission and the final course fee must be paid. The Hindu College admission process has been explained in the sections below."},{"College Name":"SRCC Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/4417_SRCC_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | BA ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"SRCC Admission 2024 has started on the official website. The college carries out admission to all UG and PG courses through Delhi University’s Common Seat Allocation System (DU CSAS). For BA (Hons) Economics and B.Com (Hons) courses, CUET UG scores are accepted. SRCC accepts CUET PG for admission to MA and M.Com programs.The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The results are released within a month of the completion of exam. After this, for admission, candidates must register for the DU CSAS (UG & PG) registration process and choose SRCC and available courses as their preference. Based on the preferences & reservation criteria, Delhi University releases the seat allotment results in multiple rounds. The SRCC admission cut off for BA (Hons) Economics and B.Com (Hons) ranges between 760 and 785 marks for general category students. Additionally, Delhi University has introduced a reservation of one seat in every course to single girl child students as well. Once candidates get allocated SRCC with their chosen course, they must accept and lock their options to get a seat at the college. Then, the verification of documents is carried out by the college admission and the final course fee must be paid. The SRCC admission process has been explained in the sections below."},{"College Name":"Miranda House Admission 2024: CUET, Courses, Fees, Eligibility Criteria, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/3004_MHC.jpg?h=160&w=313&mode=stretch","Course Name":"B.Ed  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Miranda House Admission 2024 is ongoing. Miranda House conducts admission to all UG and PG courses through Delhi University’s Common Seat Allocation System (DU CSAS) portal. Admission to all the UG courses such as BA (Hons) English, B.Sc (Hons) Chemistry, BA (Hons) Sociology, BA (Hons) Philosophy, etc. is offered based on CUET UG scores. Miranda House accepts CUET PG scores for MA and M.Sc admissions.The CUET UG exams are conducted in the month of March and the CUET PG is conducted in the month of May\/June every year. The results are generally released within a month of the exam. After this, for admission to Miranda House, candidates have to register themselves in the DU CSAS registration process and choose Miranda House and available courses as their preference. Based on the preferences & reservation criteria, Delhi University releases the seat allotment results in multiple rounds. The Miranda House admission cut-off for BA (Hons) Sociology and BA (Hons) Economics ranges between 750 and 785 marks for general category students. In addition to category-wise seat reservation, Delhi University has introduced a reservation of one seat in every course to single girl child students as well.Once candidates get allocated Miranda House with their chosen course, they must accept and lock their options to get a seat at the college. Then, the verification of documents is carried out by the college admission and the final course fee must be paid. The Miranda House admission process has been explained below in detail."},{"College Name":"SGTB Khalsa College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14920635735.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Shri Guru Tegh Bahadur Khalsa College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The SGTB Khalsa College admission cutoff 2024 is expected to range between 750 and 770 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 230 marks out of 300. The registration process for admission to SGTB Khalsa College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The SGTB Khalsa College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Lady Shri Ram College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14918218951444135101LSRCNEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Ed ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Lady Shri Ram College (LSR) Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels. The entrance exams are administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in the month of May\/June by NTA, every year. The LSR admission cutoff 2024 is expected to range between 705 and 770 marks for all the UG courses. The registration process for admission to Lady Shri Ram College generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The LSR courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Mata Sundri College for Women, Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/2949_MSC_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Ed ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Mata Sundri College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The SGTB Khalsa College admission cutoff 2024 is expected to range between 693 and 770 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 200 – 210 marks out of 300. The registration process for admission to Mata Sundri College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The SGTB Khalsa College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Deshbandhu College, Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1491893369cover..jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Deshbandhu College Delhi Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Deshbandhu College admission cutoff 2024 is expected to by 770+ marks for B.Com (Hons) which is the highest among all courses. For admission to the PG courses, the CUET PG cutoff marks is expected to range between 190 – 230 marks out of 300. The registration process for Deshbandhu College and other affiliated colleges of Delhi University generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Deshbandhu College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Acharya Narendra Dev College Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/15560_ANDV_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Acharya Narendra Dev College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The ANDC Delhi admission cutoff 2024 is expected to range between 755 and 770 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 210 marks out of 300. The registration process for admission at Acharya Narendra Dev College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The ANDC Delhi courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Dyal Singh College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1239_DSC_New.jpg?h=160&w=313&mode=stretch","Course Name":"","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Dyal Singh College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Dyal Singh College admission cutoff 2024 for the BA (Hons) Sanskrit and BA (Hons) Urdu is expected to be 539 marks. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 230 marks out of 300. The registration process for admission to Dyal Singh College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Dyal Singh College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Swami Shraddhanand College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14919129651446283950SSCNew.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Swami Sharaddhananad College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels. The entrance exams are administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in May\/June by NTA, every year. The Swami Shraddhanand admission cutoff 2024 is expected to range between 693 and 750 marks for all the UG courses. For admission at Swami Shraddhanand College, the registration process generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Swami Shraddhanand College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check: Swami Shraddhanand College Courses & Fees"},{"College Name":"NIT Nagaland Courses Admissions 2024: Eligibility, Cutoff, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/28219_NITNAGALAND.jpg?h=160&w=313&mode=stretch","Course Name":"BE\/B.Tech  | M.Phil\/Ph.D in Science ","Application Date":"June 29th, 2024","College Location":"Dimapur,  Nagaland","College Afilliation":"","College Info":""},{"College Name":"Kirori Mal College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14918925121444136740KMCNEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Kirori Mal College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Kirori Mal College admission cutoff 2024 is expected to range between 755 and 770 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 240 marks out of 300. The registration process for admission to Kirori Mal College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Kirori Mal College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Motilal Nehru College Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/3040_MOTILALNCD_APP.jpg?h=160&w=313&mode=stretch","Course Name":"BA ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Motilal Nehru College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Motilal Nehru College admission cutoff 2024 is expected to range between 755 and 767 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 200 – 240 marks out of 300. The registration process for admission to Motilal Nehru College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Motilal Nehru College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Table of Content"},{"College Name":"College of Vocational Studies Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1492415426cvr.png?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"College of Vocational Studies Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The SGTB Khalsa College admission cutoff 2024 is expected to range between 608 and 747 marks for all the UG courses. The registration process for admission to the College of Vocational Studies generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The College of Vocational Studies courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Lakshmibai College, Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1492674537cvrnew.png?h=160&w=313&mode=stretch","Course Name":"","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Lakshmibai College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Lakshmibai College admission cutoff 2024 is expected to range between 608 and 770 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 200 – 215 marks out of 300. For admission to Lakshmibai College, the registration process generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Lakshmibai College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check: Lakshmibai College Courses & Fees"},{"College Name":"Calicut University Admissions 2024: Application Form, UG, PG, PhD, Courses, Eligibility, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1504679070148151984966.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Ed ","Application Date":"June 29th, 2024","College Location":"Calicut,  Kerala","College Afilliation":"","College Info":""},{"College Name":"Janki Devi Memorial College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14916445841446029424JDMCNEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Janki Devi Memorial College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Janki Devi Memorial College admission cutoff 2024 is expected to range between 716 and 755 marks for all the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 240 marks out of 300. The registration process for admission to Janki Devi Memorial College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Janki Devi Memorial College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Zakir Husain College, New Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14919983671445344607ZHCNew.jpg?h=160&w=313&mode=stretch","Course Name":"","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Zakir Husain College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Dyal Singh College admission cutoff 2024 for the BA (Hons) Psychology and B.Com (Hons) is expected to be 755+ marks for the general category students. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 240 marks out of 300. The registration process for admission to Zakir Husain Delhi College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Zakir Husain Delhi College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check: Zakir Husain College Courses & Fees"},{"College Name":"Jesus & Mary College (JMC) Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14918878411444051059JMCNEW.jpg?h=160&w=313&mode=stretch","Course Name":"BA ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Jesus and Mary College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. The CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Jesus and Mary College admission cutoff 2024 for the BA (Hons) English and BA (Hons) Psychology is expected to be 739+ marks. For admission to PG courses, the CUET PG cutoff marks is expected to range between 200 – 215 marks out of 300. The registration process for admission to Jesus and Mary College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Jesus and Mary College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check Jesus & Mary College Courses & Fees"},{"College Name":"Shivaji College, Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/4254_SC_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Shivaji College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels, which is administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in the month of May\/June by NTA, every year. The Shivaji College admission cutoff 2024 for the B.Sc (Hons.) Chemistry and B.Sc (Hons.) Zoology is expected to be 732+ marks. For admission to PG courses, the CUET PG cutoff marks is expected to range between 200 – 215 marks out of 300. The registration process for admission to Shivaji College generally starts after the declaration of CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Shivaji College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check Shivaji College Courses & Fees"},{"College Name":"Shaheed Bhagat Singh College (SBSC), Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/4192_SBSC_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Shaheed Bhagat Singh College (SBSC) Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels. The entrance exams are administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in the month of May\/June by NTA, every year. The SBSC admission cutoff 2024 is expected to range between 705 and 770 marks for all the UG courses. The registration process generally starts after the declaration of the CUET results for admissions at Shaheed Bhagat Singh College. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The SBSC courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check Shaheed Bhagat Singh College (SBSC) Courses & Fees"},{"College Name":"Shyam Lal College Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/148742155400.jpg?h=160&w=313&mode=stretch","Course Name":"BA ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Shyam Lal College Admission 2024 is ongoing. The college offers admissions to all the courses through the Delhi University Common Seat Allocation System (DU CSAS). The Shyam Lal College admission process is based on Common University Entrance Test (CUET) scores conducted by NTA. Admissions to UG courses will be through the CUET UG exam whereas candidates who wish to apply for the PG courses are required to apply for the CUET PG exam. It is followed by a centralized seat allotment process by Delhi University through the DU CSAS portal. The Shyam Lal College admission cutoff 2024 is expected to range between 660 and 748 marks for UG admission (general category). For admission to PG courses, the general category candidates must score 200+ marks out of 300 in 2024.The registration process for admission to Shyam Lal College generally starts after the declaration of the CUET result. Then, interested candidates must register on the DU CSAS portal and choose their college and available course preferences. The entire selection process is done in multiple rounds through the DU CSAS portal for UG and PG courses. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the Shyam Lal College admission fee after seat allotment. The Shyam Lal College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"SPM College, New Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1487417924n.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Ed ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Shyama Prasad Mukherji College for Women Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels. The entrance exams are administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in the month of May\/June by NTA, every year. The SPM College admission cutoff 2024 for the BA (Hons.) English and B.Com courses is expected to be 732+, 693+ for B.Sc (Hons.) Computer Science course. For admission at Shyama Prasad Mukherji College, the registration process generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The SPM College courses, eligibility criteria, cutoff, and admission process are discussed in the article below."},{"College Name":"Rajdhani College, Delhi Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/3631_RCDU_APP.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Rajdhani College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels. The entrance exams are administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in the month of May\/June by NTA, every year. The LSR admission cutoff 2024 is expected to range between 747 and 770 marks for all the UG courses and 200-240 for PG courses. The registration process for admission generally starts after the declaration of the CUET result at the Rajdhani College. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Rajdhani College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check Rajdhani College Courses & Fees"},{"College Name":"Kamala Nehru College Admission 2024: Courses, Eligibility, Cutoff, Application Form, Last Date","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14918109041444051539KNCNEW1.jpg?h=160&w=313&mode=stretch","Course Name":"B.Com  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Kamala Nehru College Admission 2024 has started. The admission process is carried out for all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). The college accepts CUET scores as the basis of admission to both UG and PG levels. The entrance exams are administered by NTA. CUET UG is generally conducted in March and CUET PG is conducted in the month of May\/June by NTA, every year. The KNC admission cutoff 2024 is expected to range between 539 and 753 marks for all the UG courses. The cutoff 2024 for PG courses is expected to range between 200-215 marks out of 300 in CUET PG.For admission at Kamala Nehru College, the registration process generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The KNC courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Check: Kamla Nehru College Courses & Fees"},{"College Name":"Lady Irwin College, Delhi Admission 2024: Courses, Cutoff, Eligibility, Application Process, Dates","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/6890_IRVIN_APP.png?h=160&w=313&mode=stretch","Course Name":"B.Ed  | B.Sc ","Application Date":"June 29th, 2024","College Location":"New Delhi,  Delhi NCR","College Afilliation":"DU, New Delhi","College Info":"Lady Irwin College Admission 2024 has started. The admission process is carried out to all UG and PG courses through the centralized Delhi University Common Seat Allocation System (DU CSAS). For admission to certificate and PG Diploma courses, merit in the last qualifying exam is accepted by the college. The college accepts CUET scores as the basis of admission to both UG and PG levels, administered by NTA. CUET UG is generally conducted in March and the CUET PG is conducted in the month of May\/June by NTA, every year. The Lady Irwin College admission cutoff 2024 is expected to range between 701 and 755 marks for the UG courses. For admission to PG courses, the CUET PG cutoff marks is expected to range between 190 – 210 marks out of 300. The registration process for admission to Lady Irwin College generally starts after the declaration of the CUET result. Candidates who selected Delhi University while filling out the CUET application can register themselves on the DU CSAS portal and choose [College + Course] preferences. The entire selection process is done via the DU CSAS portal for the UG & PG courses in multiple rounds. Candidates can check the seat allotment result on the CSAS dashboard. They can confirm their seat by paying the admission fee after seat allotment. The Lady Irwin College courses, eligibility criteria, cutoff, and admission process are discussed in the article below.Table of Content"},{"College Name":"IIT Bombay Course Admissions 2024: Cutoff, Eligibility, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/25703_IIT_New.jpg?h=160&w=313&mode=stretch","Course Name":"M.Phil\/Ph.D in Arts  | M.Phil\/Ph.D in Engineering ","Application Date":"June 29th, 2024","College Location":"Mumbai,  Maharashtra","College Afilliation":"","College Info":"IIT Bombay Admission 2024 is based on national-level entrance examinations followed by different rounds of counselling. Students aspiring to take admission to IIT Bombay must fulfill the minimum eligibility criteria. The selection rounds of IIT Bombay involve entrance exams, counselling rounds, written tests and interviews. "},{"College Name":"NIT Puducherry Courses Admissions 2024: Eligibility, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14866460651436767574front222222222.jpg?h=160&w=313&mode=stretch","Course Name":"BE\/B.Tech  | M.Phil\/Ph.D in Arts ","Application Date":"June 29th, 2024","College Location":"Pondicherry,  Puducherry","College Afilliation":"","College Info":"NIT Puducherry admission to various UG , PG and doctorate level programs is based on national level exams accepted by the institute. NIT Puducherry offers a four-year B.Tech program in 5 specializations. Out of 5 specializations offered, the most opted stream at the institute is Computer Science and Engineering (CSE) with a cutoff ranging from 13263 to 16549 in the JoSAA Counselling. For the B.Tech admissions at NIT Puducherry, candidates are required to appear for JEE Main examination and participate in the JoSAA counseling for the final seat allotments. NIT Puducherry Charges a fee of INR 54,366 per year for its B.Tech program. NIT Puducherry also offers admission to the M.Tech and Ph.D. programs. Admissions to the M.Tech program are done on the basis of GATE scores, while Ph.D. admissions are based on the written test and interview conducted by the institute."},{"College Name":"Hyderabad University Admission 2024: UG, PG, PhD, Application Form, Courses, Eligibility, Last Date To Apply","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/15090869991448022137UOHNEW.jpg?h=160&w=313&mode=stretch","Course Name":"M.Phil\/Ph.D in Arts  | M.Phil\/Ph.D in Education ","Application Date":"June 29th, 2024","College Location":"Hyderabad,  Telangana","College Afilliation":"","College Info":"University of Hyderabad (UoH), also known as Hyderabad University offers PG, Integrated-PG, and Doctorate level courses in disciplines of engineering, management, science, technology, etc. Admissions to the PG courses are based on the scores of national level exams such as CUET PG, CAT, and NIMCET followed by Counselling. Integrated PG course admissions are based on CUET UG exam scores followed by counseling. University of Hyderabad Ph.D. admission is based on the entrance exam and the interview conducted by the university. Candidates are required to apply online for Hyderabad University admission. Complete details about University of Hyderabad admissions have been provided below. Check University of Hyderabad Courses and Fees"},{"College Name":"Bansal College of Pharmacy Admission 2024: Eligibility, Selection Criteria, Dates, Application process, Cut off","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1593097716cover.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Bhopal,  Madhya Pradesh","College Afilliation":"RGPV, Bhopal","College Info":"Bansal College of Pharmacy is a prestigious pharmacy college in Bhopal which provides quality education in the field of pharmaceutical sciences. Presently, the college is offering B.Pharm and B.Pharm (Lateral) at the UG level. Admissions are based on the rules formulated by the Directorate of Technical Education, Madhya Pradesh Govt."},{"College Name":"Arya College of Pharmacy (ACP), Jaipur Admission 2023, Fees Structure, Courses, Review, Entrance","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1626091021Screenshot20210712172449.png?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Jaipur,  Rajasthan","College Afilliation":"RUHS, Jaipur","College Info":"Arya College of Pharmacy (ACP) is located at Jaipur, Rajasthan. It was established in the year 2004, as a part of Arya Group of Colleges. This institute is affiliated with Rajasthan University of Health Science (RUHS).Arya College of Pharmacy provides B.Pharm program at UG level. It also offers M.Pharm in two specializations at PG level."},{"College Name":"NIT Manipur Courses Admissions 2024: Eligibility, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/28221_NITM_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"BE\/B.Tech  | M.Phil\/Ph.D in Science ","Application Date":"June 29th, 2024","College Location":"Imphal,  Manipur","College Afilliation":"","College Info":"NIT Manipur admission to various UG , PG and doctorate level programs is based on national level exams accepted by the institute.NIT Manipur offers a four-year B.Tech program in 5 specializations. Out of 5 specializations offered, the most opted stream at the institute is Computer Science and Engineering (CSE) with a cutoff ranging from 27,773 to 83,476 in the JoSAA Counselling. For the B.Tech admissions at NIT Manipur, candidates are required to appear for JEE Main examination and participate in the JoSAA counseling for the final seat allotments. NIT Manipur Charges a fee of INR 1.48 Lakhs per year for its B.Tech program. NIT Manipur admission process involves other national level examinations too such as GATE, IIT JAM for the programs such as M.Tech and M.Sc respectively. Admissions to the M.Tech program are done on the basis of GATE scores, while Ph.D. admissions are based on the written test and interview conducted by the institute."},{"College Name":"NIT Sikkim Courses Admissions 2024: Dates, Eligibility, Cutoff, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/28213_NITSIKKIM.jpg?h=160&w=313&mode=stretch","Course Name":"BE\/B.Tech  | M.Phil\/Ph.D in Arts ","Application Date":"June 29th, 2024","College Location":"South Sikkim,  Sikkim","College Afilliation":"","College Info":""},{"College Name":"Al-Ameen College of Pharmacy, Bangalore Admission 2024, Ranking, Placement, Cutoff","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9224_AlACP_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Bangalore,  Karnataka","College Afilliation":"RGUHS, Bangalore","College Info":"For admission in the college, candidates have to send the filled application form to the college through the post. Al-Ameen College of Pharmacy, Bangalore was established in 1983 by Al-Ameen Educational Society.The college is affiliated to Rajiv Gandhi University of Health Sciences, Bangalore"},{"College Name":"Acharya and BM Reddy College of Pharmacy, Bangalore Admission 2023, Fees Structure, Placement, Courses","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/9204_ABMRCP_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Pharm ","Application Date":"June 29th, 2024","College Location":"Bangalore,  Karnataka","College Afilliation":"RGUHS, Bangalore","College Info":"Acharya and BM Reddy College of Pharmacy(ABMRCP) was established in the year 1992. It is located in Bangalore, Karnataka and is affiliated with Rajiv Gandhi University of Health Sciences. It is NBA Accredited and approved by AICTE and PCI. ABMRCP offers a wide range of programs in Pharmacy: Diploma in Pharmacy, Bachelor of Pharmacy, Pharm D, Master of Pharmacy in 8 specializations. "},{"College Name":"Sona Medical College of Naturopathy and Yoga: Eligibility, Process, Selection Criteria, Application","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1627642893WhatsAppImage20210714at11.32.17.jpeg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Salem,  Tamil Nadu","College Afilliation":"TNMGRMU, Chennai","College Info":"Sona Medical College of Naturopathy and Yoga, Salem offers undergraduate programs in the discipline of Naturopathy and Yoga. It is affiliated to The Tamil Nadu Dr. M.G.R Medical University, Chennai and approved by the Government of Tamil Nadu."},{"College Name":"BASE Bangalore Admissions 2024: Courses, Fees, Entrance, Eligibility","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1584516061cover.jpeg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Bangalore,  Karnataka","College Afilliation":"","College Info":"Dr. B.R. Ambedkar School of Economics (BASE) offers a B.Sc and an M.Sc level courses in the field of Economics. Admissions are entrance based and merit based depending upon the choice of course. There are only two courses offered at BASE."},{"College Name":"Babu Madhav Institute of Information Technology Admission 2024: Application form, Eligibility, Selection Criteria, Fees","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1597148585Cover.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Bardoli,  Gujarat","College Afilliation":"Uka Tarsadia University, Bardoli","College Info":"Babu Madhav Institute of Information Technology was established in the year 2011 and imparting knowledge to the students as well as society. Babu Madhav Institute of Information Technology, popularly known as BMIIT is the premier institute of Uka Tarsadia University which offers Undergraduate and Postgraduate courses on a regular basis in the field of Information Technology. It also offers an integrated course combining the Graduate and Postgraduate courses."},{"College Name":"Shivaji Science College Nagpur Admission 2024: Courses, Fees, Eligibility, Registration Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1487327555a732fb77a88ad1f46351858cfd6e15b7.png?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Nagpur,  Maharashtra","College Afilliation":"RTMNU, Nagpur","College Info":"Shivaji Science College, Nagpur is one of the many academic institutions under Shri Shivaji Education Society, Amravati. Affiliated to R.T.M. Nagpur University, the institution was established in 1967. The UGC recognised college is one of the members of Asia Pacific Quality Network (APQN).The college conducts academic courses at different levels such as B.Sc and BCA at UG level and M.Sc. and MCA at PG level."},{"College Name":"Sai Institute of Pharmaceutical & Allied Sciences (SIPAS) Admission 2023: Scholarship, Important dates","College Logo":"https:\/\/images.collegedunia.com\/public\/asset\/img\/exam\/news\/news8.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Dehradun,  Uttarakhand","College Afilliation":"HNBGU, Garhwal","College Info":"SIPAS was established in the year 2003 and it is located in Dehradun, Uttarakhand. SIPAS is the part of prestigious Sai Group of Institutions which offers various courses in the field of Paramedical & Allied Sciences, Management and Nursing. At present, SIPAS offers BPT, B.Sc (Medical), MPT and M.Sc (Medical) courses at the UG and PG levels."},{"College Name":"SVYASA DDE Admission 2023: M.Sc. Admission, Eligibility","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/56479_s.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Bangalore,  Karnataka","College Afilliation":"S-VYASA, Bangalore","College Info":"S-VYASA offers B.Sc and M.Sc courses along with PG Diploma in Yoga Yoga Therapy & Yoga Education. Candidates are selected on the basis of their marks in the qualifying examination. SVYASA DDE releases the merit list for shortlisted candidates. Final admission is granted on the basis of counselling.Application form can be downloaded from the official website or can be obtained from the admission office. Duly filled form can be submitted in person or through post. The candidates can also mail the application form along with the relevant documents.Read More: SVYASA DDE Fee Structure"},{"College Name":"DUVASU, Mathura Admission 2024: Entrance Exam, Application form","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/29003_DUVSA_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Mathura,  Uttar Pradesh","College Afilliation":"","College Info":"Pandit Deen Dayal Upadhyaya Pashu Chikitsa Vigyan Vishwavidyalaya Evam Go Anusandhan Sansthan is a State University located in Mathura, Uttar Pradesh. This prestigious university was established in 2001.DUVASU, Mathura offers B.Sc and BV.Sc & AH courses at the UG level and it offers M.Sc and MV.Sc & AH programs at the PG level. The university also offers Ph.D courses at the Research level and various Diploma courses are also available."},{"College Name":"Kota University Admission 2024: Form, Fees, Courses, Entrance Exam, Eligibility, Selection Process, Last Date to Apply","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1509087612fv.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Kota,  Rajasthan","College Afilliation":"","College Info":"Kota University is a well recognised affiliating University Rajasthan with more than 175 colleges affiliated to it. University has a well developed and experienced faculty of 23 Academic staff members for rendering education of UG, PG and doctoral courses in multiple specialisations. Some of the popular courses offered by Kota University are MBA, M.Sc, M.P.Ed & B.Pharma. Check Kota University Courses & FeesAdmission to the UG courses like BSc and B.Pharma are given on the basis of of merit scores achieved by the students in class 10 + 2 to board level Examination whereas for PG courses other than M.P.Ed., Kota University conducts entrance examinations on the basis of which admission is granted to the candidates. However the candidates have to secure minimum required marks for taking admission in UG and PG courses. Besides this, Kota University also provides relaxation of 5% marks for reserved categories SC, ST, OBC, SOBC & PH. The university provides a lot of internship opportunities to the deserving students so that they can learn the skills for achieving jobs in off campus placement programs. However there are less placement opportunities provided to the students in Kota University. The highest placement package offered to any student was 3.5 lakh per annum.Read more: Kota University Placement"},{"College Name":"Central University of Kashmir Admission 2024: UG, PG, Courses, Eligibility, Application Form, Dates","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1503993044cvr.png?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Srinagar,  Jammu and Kashmir","College Afilliation":"","College Info":"The Central University of Kashmir is a state university offering admission in fields of Arts, Science, Commerce, Technology, Education, Physical Education, Law, Management, etc, located in a sprawling 305-acres campus at Srinagar, Jammu & Kashmir. The university offers various Undergraduate, Postgraduate, and Doctoral programs in the areas of Arts, Science, Commerce, Technology, Management, Computer Science, Home Science, Social Science & so on. Central University of Kashmir offers B.Voc in 2 disciplines, BA.LL.B. at the UG level, Integrated B.Sc-M.Sc programs in 4 disciplines, Integrated B.Ed-M.Ed, M.Tech in 1 discipline, M.Sc in 3 disciplines, MA in 10 disciplines, M.Com, MBA, MTTM, M.Ed, M.P.Ed, LL.M. at the PG level along with M.Phil-Ph.D. at the Research level in various disciplines of Arts, Science, and Management. The university also offers some PG Diploma courses under few specializations. The university allows admission to all UG and PG courses is based on an entrance examination namely CUET. The university accepts admission to the MBA program is done based on an entrance exam namely CMAT followed by GD-PI. Admission to M.Tech is based on the performance in CUET PG\/ GATE\/ UGC-NET\/ JRF\/ JEST. The university grants admission to Research courses is done based on CUET\/ NET\/ GATE\/ JRF\/ SET followed by counseling conducted by the university.Read More: Central University of Kashmir News & Articles"},{"College Name":"Junagadh Agricultural University Admission 2024: Courses, Application Process,Merit List","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/25497_JUNAGADHUNI.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Junagadh,  Gujarat","College Afilliation":"","College Info":"Junagadh Agricultural University offers various courses in the field of Agriculture through its five colleges namely College of Agriculture, College of Agriculture Engineering and Technology, College of Fisheries, College of Veterinary Science and Animal Husbandry & P.G. Institute of A.B.M. (Agriculture Business Management).A number of courses at UG, PG and Ph.D. level are offered by the University under various specializations. The application procedure for these courses start mainly by the month of June. The admission to the UG courses are based on the GUJCET score obtained by the candidates, whereas, for admission to the PG and Ph.D. courses, the candidates need to sit for an entrance test conducted by the University.The reservation of seats for different categories are as follows:"},{"College Name":"Bankatlal Badruka College for Information Technology (BBCIT), Hyderabad Admission 2024: Admission form, Eligibility","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/23865_66.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Hyderabad,  Telangana","College Afilliation":"Osmania University, Hyderabad","College Info":"Bankatlal Badruka College for Information Technology was established in the year 1991 in Hyderabad, Telangana. BBCIT is affiliated to Osmania University and is approved by AICTE, New Delhi.BBCIT runs BSc course of 3-years duration with 4 specializations and MSc course of 2-years duration with 3 specializations."},{"College Name":"Patna Science College, Patna Admission 2024: PG Admission, Application Form, Placements, Entrance Exam, Fees","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1515490723cvrimgenew.png?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Patna,  Bihar","College Afilliation":"Patna University, Patna","College Info":"Patna Science College was established in 1927 in Patna, Bihar. The institute has been recognized as a Premier Institution of higher learning in science stream in India. It is affiliated to Patna University. The institute offers B.Sc. degree in total ten specializations under which three specializations comes under Self-financing or Vocational courses."},{"College Name":"JIPMER Admission 2024: Dates, Courses, Eligibility, Entrance Exam, Fees, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/1503478867cvr.png?h=160&w=313&mode=stretch","Course Name":"B.Sc  | B.Sc (Medicine) ","Application Date":"June 29th, 2024","College Location":"Pondicherry,  Puducherry","College Afilliation":"","College Info":"JIPMER offers admission to UG, PG, Super Specialty, and Doctoral courses in the fields of Medicine, Nursing, and Allied Health Sciences. The institute offers MBBS, B.Sc Nursing, and B.Sc in Allied Health Sciences at the undergraduate level. At the postgraduate level, the institute offers MD, MS, MDS, M.Sc Nursing, MPH, and M.Sc in Allied Health Sciences. JIPMER offers DM and M.Ch at the Super Specialty level and Ph.D. at the doctoral level in the streams of Medicine, Science, and Public Health. Apart from degree courses, the institute also offers various diploma and certificate courses. "},{"College Name":"KK Shah Jarodwala Maninagar Science College (KKSJMSC), Ahmedabad Admission 2024: B.Sc. Admission, Eligibility","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/16655_KKSJMSC_New.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Ahmedabad,  Gujarat","College Afilliation":"Gujarat University, Ahmedabad","College Info":"KK Shah Jarodwala Maninagar Science College (KKSJMSC), Ahmedabad was established in 1975. The college is located in Ahmedabad and is affiliated with Gujarat University. KK Shah Jarodwala College offers B.Sc, M.Sc & Ph.D. courses at the UG, PG and Ph.D. level."},{"College Name":"MB Khalsa College, Indore Admission 2024:  Admission, Application form","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/14909404801443870600MBKCNEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc ","Application Date":"June 29th, 2024","College Location":"Indore,  Madhya Pradesh","College Afilliation":"DAVV, Indore","College Info":"MB Khalsa College was established in the year 1990 and is affiliated to Devi Ahilya Vishwavidhyalaya. It is located in Indore, Madhya Pradesh. The college offers various courses in Commerce, Management, Biotechnology and Information Technology disciplines leading to B.Com, B.Sc, BJMC, B.LI.Sc, BCA and BBA in UG and M.Sc. and M.Com in PG programs."},{"College Name":"NIMHANS Admission 2024: Courses, Fees, Eligibility, Selection Criteria, Application Process","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/25619_NIMHANS_NEW.jpg?h=160&w=313&mode=stretch","Course Name":"B.Sc  | B.Sc (Nursing) ","Application Date":"June 29th, 2024","College Location":"Bangalore,  Karnataka","College Afilliation":"","College Info":"Some of the important admission highlights of NIMHANS are mentioned below:"},{"College Name":"St Francis De Sales College (SFS), Nagpur Admission 2024: Application process, Reservation, Scholarship","College Logo":"https:\/\/images.collegedunia.com\/public\/college_data\/images\/appImage\/4911_SFS_New.jpg?h=160&w=313&mode=stretch","Course Name":"","Application Date":"June 29th, 2024","College Location":"Nagpur,  Maharashtra","College Afilliation":"RTMNU, Nagpur","College Info":"St Francis De Sales College (SFS), established in 1956, is a catholic minority institution located in Nagpur, Maharashtra. The college is managed by Nagpur Roman Catholic Diocesan Corporation (NRCDC) and is affiliated to Rashtrakant Tukadoji Maharaj Nagpur University (RTMNU). St Francis De Sales College offers various Undergraduate (UG) and Postgraduate (PG) courses in the field of Arts, Science and Computers."}]